; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	spectrograph0 - mode
	thermograph2 - mode
	thermograph1 - mode
	Star0 - direction
	Star1 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation9 - direction
	Star5 - direction
	Star4 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation8 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star5)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 thermograph1)
	(supports instrument5 thermograph2)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation8)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
)
(:goal (and
	(have_image Star10 thermograph2)
	(have_image Phenomenon11 thermograph2)
	(have_image Phenomenon12 thermograph1)
	(have_image Planet13 spectrograph0)
	(have_image Star14 spectrograph0)
))

)

; plan
1. (turn_to satellite2 groundstation8 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 groundstation8)
   goals met: 0 of 5
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 5
3. (calibrate satellite2 instrument5 groundstation8)
   added: (calibrated instrument5)
   goals met: 0 of 5
4. (turn_to satellite2 phenomenon12 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 phenomenon12)
   goals met: 0 of 5
5. (take_image satellite2 phenomenon12 instrument5 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 1 of 5
6. (turn_to satellite2 phenomenon11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon11)
   goals met: 1 of 5
7. (take_image satellite2 phenomenon11 instrument5 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 2 of 5
8. (turn_to satellite2 planet13 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet13)
   goals met: 2 of 5
9. (take_image satellite2 planet13 instrument5 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 3 of 5
10. (turn_to satellite2 star10 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 star10)
   goals met: 3 of 5
11. (take_image satellite2 star10 instrument5 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 4 of 5
12. (turn_to satellite2 star14 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star14)
   goals met: 4 of 5
13. (take_image satellite2 star14 instrument5 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 5 of 5
